In [1]:
import numpy as np
import pandas as pd

In [5]:
Q1 = pd.Series(['Stina Calista','Fran Hendrix','Cyril Isak','Danilo Norina'], 
               index=[5281224,4223241,4233342,5012332])

5281224    Stina Calista
4223241     Fran Hendrix
4233342       Cyril Isak
5012332    Danilo Norina
dtype: object

In [9]:
Q2 = {
    'Roger Clemens': 133.7,
    'Cy Young': 131.5,
    'Walter Johnson': 117.1,
    'Greg Maddux': 116.7,
    'Randy Johnson': 110.4

}

Roger Clemens     133.7
Cy Young          131.5
Walter Johnson    117.1
Greg Maddux       116.7
Randy Johnson     110.4
dtype: float64

In [ ]:
Q3 = pd.Series(Q2)

In [11]:
occupation = pd.Series(['Accountant','Data scientist','Manager','Security staff'],
                      index=[5281224,4223241,4233342,5012332])
Q4 = pd.DataFrame({'Name':Q1,
                  'Occupation':occupation})

                  Name      Occupation
5281224  Stina Calista      Accountant
4223241   Fran Hendrix  Data scientist
4233342     Cyril Isak         Manager
5012332  Danilo Norina  Security staff

In [15]:
pop_dict = {
    'China': 1411778724,
    'India': 1378331486,
    'United States': 331865271,
    'Indonesia': 271350000,
    'Pakistan': 225200000
}

area_dict = {
    'Russia': 17098246,
    'Canada': 9984670,
    'China': 9596961,
    'United States': 9525067,
    'Brazil': 8515767
}

Q5 = pd.DataFrame(
    {'Population':pop_dict,
    'Area':area_dict}
)

                 Population        Area
China          1.411779e+09   9596961.0
India          1.378331e+09         NaN
United States  3.318653e+08   9525067.0
Indonesia      2.713500e+08         NaN
Pakistan       2.252000e+08         NaN
Russia                  NaN  17098246.0
Canada                  NaN   9984670.0
Brazil                  NaN   8515767.0

In [20]:
# Use .loc to select only the China and the United States from Q5, and assign to Q6

Q6 = Q5.loc[['China','United States']]

                 Population       Area
China          1.411779e+09  9596961.0
United States  3.318653e+08  9525067.0

In [22]:
# Use .loc to select observations of Q5 with a population greater than 270000000. Assign it to Q7

Q7 = Q5.loc[Q5['Population'] > 270000000]

                 Population       Area
China          1.411779e+09  9596961.0
India          1.378331e+09        NaN
United States  3.318653e+08  9525067.0
Indonesia      2.713500e+08        NaN

In [23]:
# Use .loc to select observations of Q5 with an area greater than 9600000. Assign it to Q8.

Q8 = Q5.loc[Q5['Area'] > 9600000]

        Population        Area
Russia         NaN  17098246.0
Canada         NaN   9984670.0